gcc -g p4original.c
 ./a.out
Enter array length: 3
Enter Array elements: 1
3
11

The contents of the array are: 1 3 11 


Hence, The sum of numbers in the array = 15 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x77b: file p4original.c, line 10.
(gdb) l
1   #include <stdio.h>
2
3   int input();
4
5   void arrInput();
6   int arrSum(int n, int a[n]);
7   int output(int n, int a[n], int sum);
8
9   int main()
10  {
(gdb) r
Starting program: /home/runner/pps-IA1-practice-1/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p4original.c:10
10  {
(gdb) n
13      n = input();
(gdb) n
Enter array length: 3
15      int arr[n];
(gdb) 1
Undefined command: "1".  Try "help".
(gdb) n
17      arrInput(n, arr);
(gdb) n
Enter Array elements: 1
3
11
18      ans = arrSum(n, arr);
(gdb) n
20      output(n, arr, ans);
(gdb) n

The contents of the array are: 1 3 11 


21  }
(gdb) n
__libc_start_main (main=0x55dcf100076a <main>, argc=1, argv=0x7ffeedfabbf8, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffeedfabbe8) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) n
Hence, The sum of numbers in the array = 15[Inferior 1 (process 1048) exited normally]